C1_TEST_MESH_3_SURFACES/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       1267772;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       1267872;
    }
    minY
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          4170;
        startFace       1267972;
    }
    maxY
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          4170;
        startFace       1272142;
    }
    minZ
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          4170;
        startFace       1276312;
    }
    maxZ
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          4170;
        startFace       1280482;
    }
    window_wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          43776;
        startFace       1284652;
    }
)

// ************************************************************************* //
