C1_TEST_MESH_3_SURFACES/system/externalFunctionObject2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |                                                 
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           
   \\    /   O peration     | Website:  https://openfoam.org                                                
    \\  /    A nd           | Version:  13                                                
     \\/     M anipulation  |                                                 
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functionObject;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


windowOpeningFlowRateCutPlane
{
	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	log             true;
	writeControl    timeStep;
	writeInterval   1;
	
	writeFields	true; // I'm interested in this value
	surfaceFormat	vtk;

	sampledSurface
	{
		type	cutPlane;
		planeType	pointAndNormal;
		point (-5 0 0);
		//point	(0.05 0 0);
		normal	(1 0 0);
		interpolate	true;
	}

	operation       areaNormalIntegrate;

	fields          (U);
}

windowOpeningFlowRateCutPlane2
{
	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	log             true;
	writeControl    timeStep;
	writeInterval   1;
	
	writeFields	true; // I'm interested in this value
	surfaceFormat	vtk;

	sampledSurface
	{
		type	bacutPlane;
		planeType	pointAndNormal;
		point	(2.5 0 0);
		normal	(1 0 0);
		interpolate	true;
	}

	operation       areaNormalIntegrate;

	fields          (U);
}
